<?php

use yii\db\Migration;

/**
 * Class m190808_202027_create_dump
 */
class m190808_202027_create_dump extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('{{%cover_type}}', ['id', 'name'], [
            [1, 'Мягкая'],
            [2, 'Твердая']
        ]);

        $this->batchInsert('{{%book}}', ['id', 'name', 'edition', 'cover_type_id'], [
            [1, 'Мастер и Маргарита', 1000, 1],
            [2, 'Евгений Онегин', 5000, 2],
            [3, 'Преступление и наказание', 8000, 1],
            [4, 'Война и мир', 5000, 2],
            [5, 'Маленький принц', 1800, 1],
            [6, 'Герой нашего времени', 1000, 1],
            [7, 'Двенадцать стульев', 4000, 2],
            [8, 'Гарри Поттер и философский камень', 16000, 1],
        ]);

        $this->batchInsert('{{%category}}', ['id', 'name'], [
            [1, 'Категория 1'],
            [2, 'Категория 2'],
            [3, 'Категория 3'],
            [4, 'Категория 4']
        ]);

        $this->batchInsert('{{%book_category}}', ['book_id', 'category_id'], [
            [1, 1],
            [1, 2],
            [1, 3],
            [1, 4],
            [2, 1],
            [2, 2],
            [2, 3],
            [2, 4],
            [3, 2],
            [4, 4],
            [5, 2],
            [6, 1],
            [7, 1],
            [7, 2],
            [7, 4],
            [8, 2],
            [8, 3],
            [8, 4],
        ]);
    }
}
